icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/vdr.c
VDR_08_USERDATA vdr_08_userdata;

typedef __packed struct _vdr_userdata
{
	uint8_t		id;             /*对应的vdr类型 8-15*/
	uint16_t	record_total;   /*总得记录数*/
	uint16_t	record_remain;  /*还没有发送的记录数*/

	uint32_t	sector_from;    /*信息开始的扇区*/
	uint32_t	index_from;     /*信息开始的扇区内记录号*/

	uint32_t	sector_to;      /*信息结束的扇区*/
	uint32_t	index_to;       /*信息结束的扇区内记录号*/

	uint32_t	sector;         /*当前操作信息的扇区*/
	uint32_t	index;          /*当前操作信息的扇区内记录号*/

	uint32_t addr;              /*当前要读的地址*/

	uint16_t	rec_per_packet; /*每包的记录数*/
	uint16_t	packet_total;   /*总包数*/
	uint16_t	packet_curr;    /*当前包数*/
}VDR_USERDATA;


/*
   获取id前面一条可用的地址
   并没有做搽除操作，交由写之前处理
   20130801:数据要位于4k边界处，不能跨扇区，否则环回写入时会出现问题

 */
static uint32_t vdr_08_12_get_prevaddr( uint8_t vdr_id,uint16_t prev_num )
{
	uint16_t i,index,sector;
	uint8_t id = vdr_id - 8;
	
	index = sect_info[id].index;
	sector = sect_info[id].sector;
	
	for(i=0;i<prev_num;i++)
	{
		if(index == 0)
		{
			index = sect_info[id].record_per_sector - 1;
			if(sector == 0)
			{
				sector = sect_info[id].sector_count - 1;
			}
			else
			{
				sector--;
			}
		}
		else
		{
			index--;
		}
	}
	/*
	sect_info[id].index++;
	if( sect_info[id].index >= sect_info[id].record_per_sector )
	{
		sect_info[id].index = 0;
		sect_info[id].sector++;
		if( sect_info[id].sector >= sect_info[id].sector_count )
		{
			sect_info[id].sector = 0;
		}
	}
	*/
	return sect_info[id].addr_start + sector * 4096 + index * sect_info[id].record_size;
}


/*
   获取id下一个可用的地址
   并没有做搽除操作，交由写之前处理
   20130801:数据要位于4k边界处，不能跨扇区，否则环回写入时会出现问题

 */
static uint32_t vdr_08_12_get_nextaddr( uint8_t vdr_id )
{
	uint8_t id = vdr_id - 8;
	sect_info[id].index++;
	if( sect_info[id].index >= sect_info[id].record_per_sector )
	{
		sect_info[id].index = 0;
		sect_info[id].sector++;
		if( sect_info[id].sector >= sect_info[id].sector_count )
		{
			sect_info[id].sector = 0;
		}
	}
	return sect_info[id].addr_start + sect_info[id].sector * 4096 + sect_info[id].index * sect_info[id].record_size;
}

/*保存数据 以1秒的间隔保存数据能否处理的过来**/
void vdr_08_put( MYTIME datetime, uint8_t speed, uint8_t status )
{
	uint32_t	sec;
	uint32_t	addr;

	if( ( vdr_08_time & 0xFFFFFFC0 ) != ( datetime & 0xFFFFFFC0 ) ) /*不是在当前的一分钟内*/
	{
		if( vdr_08_time != 0 )                                      /*是有效的数据,要保存，注意第一个数据的处理*/
		{
			vdr_08_info[0]	= vdr_08_time >> 24;
			vdr_08_info[1]	= vdr_08_time >> 16;
			vdr_08_info[2]	= vdr_08_time >> 8;
			vdr_08_info[3]	= vdr_08_time & 0xFF;
			vdr_08_info[4]	= HEX2BCD( YEAR( vdr_08_time ) );
			vdr_08_info[5]	= HEX2BCD( MONTH( vdr_08_time ) );
			vdr_08_info[6]	= HEX2BCD( DAY( vdr_08_time ) );
			vdr_08_info[7]	= HEX2BCD( HOUR( vdr_08_time ) );
			vdr_08_info[8]	= HEX2BCD( MINUTE( vdr_08_time ) );
			vdr_08_info[9]	= 0;

//#ifdef TEST_BKPSRAM
#if 0
			for( i = 0; i < sizeof( vdr_08_info ); i++ )
			{
				*(__IO uint8_t*)( BKPSRAM_BASE + i + 1 ) = vdr_08_info[i];
			}
			*(__IO uint8_t*)( BKPSRAM_BASE ) = 1;
#else

			addr = vdr_08_12_get_nextaddr( 8 );
			rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY_2 );
			if( ( addr & 0xFFF ) == 0 ) /*在4k边界处*/
			{
				sst25_erase_4k( addr );
			}
			sst25_write_through( addr, vdr_08_info, sizeof( vdr_08_info ) );
			rt_sem_release( &sem_dataflash );
			//rt_kprintf( "\n%d>写入08 地址:%08x(sect:count=%d:%d) 值:%08x", rt_tick_get( ), addr, sect_info[0].sector, sect_info[0].index, vdr_08_time );

#endif
			memset( vdr_08_info, 0xFF, sizeof( vdr_08_info ) ); /*新的记录，初始化为0xFF*/
		}
	}
	sec							= SEC( datetime );
	vdr_08_time					= datetime;
	vdr_08_info[sec * 2 + 10]	= gps_speed;
	vdr_08_info[sec * 2 + 11]	= vdr_signal_status;
}

/*
   每扇区存6个小时的数据
   一个小时666byte 占用680byte
 */
void vdr_09_put( MYTIME datetime )
{
	uint8_t		buf[16];
	uint32_t	addr;
	uint8_t		minute;

	if( ( vdr_09_time & 0xFFFFFFC0 ) == ( datetime & 0xFFFFFFC0 ) ) /*在同一分钟内*/
	{
		return;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY_2 );
	if( ( vdr_09_time & 0xFFFFF000 ) != ( datetime & 0xFFFFF000 ) ) /*不是是在当前的小时内,新纪录*/
	{
		addr = vdr_08_12_get_nextaddr( 9 );
		if( ( addr & 0xFFF ) == 0 )                                 /*在4k边界处*/
		{
			sst25_erase_4k( addr );
		}

		PACK_INT( buf, ( datetime & 0xFFFFF000 ) );                 /*写入新的记录头*/
		buf[4]	= HEX2BCD( YEAR( datetime ) );
		buf[5]	= HEX2BCD( MONTH( datetime ) );
		buf[6]	= HEX2BCD( DAY( datetime ) );
		buf[7]	= HEX2BCD( HOUR( datetime ) );
		buf[8]	= 0;
		buf[9]	= 0;
		sst25_write_through( addr, buf, 10 );
	}
	vdr_09_time = datetime;
	PACK_INT( buf, ( gps_longi * 6 ) );
	PACK_INT( buf + 4, ( gps_lati * 6 ) );
	PACK_WORD( buf + 8, ( gps_alti ) );
	buf[10] = gps_speed;

	minute	= MINUTE( datetime );
	addr	= VDR_09_START + sect_info[1].sector * 4096 + sect_info[1].index * 680 + minute * 11 + 10; /*跳到指定的位置,开始有10字节头*/
	sst25_write_through( addr, buf, 11 );
	rt_sem_release( &sem_dataflash );

	//rt_kprintf( "\n%d>save 09 data addr=%08x", rt_tick_get( ), addr );
}

/*
   234 byte
   这个不是秒单次触发的，而是车辆停驶产生的
 */
void vdr_10_put( MYTIME datetime )
{
	uint32_t	i, j;
	uint32_t	addr;
	uint8_t		buf[234 + 4]; /*保存要写入的信息*/
	uint8_t		* pdata;

	j		= speed_status_index;
	pdata	= buf + 28;
	for( i = 0; i < 100; i++ )
	{
		*pdata++	= speed_status[j][0];
		*pdata++	= speed_status[j][1];
		if( j == 0 )
		{
			j = 100;
		}
		j--;
	}
	buf[0]	= datetime >> 24;
	buf[1]	= datetime >> 16;
	buf[2]	= datetime >> 8;
	buf[3]	= datetime & 0xFF;
	buf[4]	= HEX2BCD( YEAR( datetime ) );
	buf[5]	= HEX2BCD( MONTH( datetime ) );
	buf[6]	= HEX2BCD( DAY( datetime ) );
	buf[7]	= HEX2BCD( HOUR( datetime ) );
	buf[8]	= HEX2BCD( MINUTE( datetime ) );
	buf[9]	= HEX2BCD( SEC( datetime ) );
	memcpy( buf + 10, jt808_param.id_0xF009, 18 );  /*驾驶证号码*/
	PACK_INT( buf + 228, ( gps_longi * 6 ) );
	PACK_INT( buf + 232, ( gps_lati * 6 ) );
	PACK_WORD( buf + 236, ( gps_alti ) );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY_2 );
	addr = vdr_08_12_get_nextaddr( 10 );
	if( ( addr & 0xFFF ) == 0 )                     /*在4k边界处*/
	{
		sst25_erase_4k( addr );
	}
	sst25_write_through( addr, buf, 238 );

	rt_sem_release( &sem_dataflash );
	//rt_kprintf( "\n%d>save 10 data addr=%08x", rt_tick_get( ), addr );
}

/*********************************************************************************
  *函数名称:uint8_t vdr_11_get_1( MYTIME start, MYTIME end, uint8_t num, uint8_t *pout )
  *功能描述:读取疲劳驾驶记录，输入起止时间，获取指定的记录数，防止溢出
  *输	入:	start	:开始时间
  			end		:结束时间
  			num		:最大记录数量
  			pout	:保存获取到的信息，仅保存疲劳开始时间和结束时间，格式均为6字节BCD码，
  *输	出:	pout	:保存获取到的信息，仅保存疲劳开始时间和结束时间，格式均为6字节BCD码，
  *返 回 值:uint8_t	:获取到的超速记录数量
  *作	者:白养民
  *创建日期:2013-09-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
uint8_t vdr_11_get_1( MYTIME start, MYTIME end, uint8_t num, uint8_t *pout )
{
 	uint32_t	addr;
	uint8_t		buf[32];
	uint32_t	id;
	uint16_t	i, count = 0;
	MYTIME		mytime1;
	MYTIME		mytime2;
	
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	
	for( i = 0; i < num+10; i++ )  /*不一次读进来了*/
	{
		addr = vdr_08_12_get_prevaddr(11,i);
		sst25_read( addr, buf, 32 );
		id = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
		if( id == 0xFFFFFFFF )  /*不是有效记录*/
		{
			continue;
		}
		mytime1 = mytime_from_bcd(buf + 4);
		mytime2 = mytime_from_bcd(buf + 10);
		if(((mytime1>=start)&&(mytime1<=end))||((mytime2>=start)&&(mytime2<=end)))
		{
			memcpy( pout + count * 12, buf + 4, 6 );
			memcpy( pout + count * 12 + 6, buf + 10, 6 );
			count++;
			if(count >= num)
				break;
		}
	}
	rt_sem_release( &sem_dataflash );
	return count;
}

/*********************************************************************************
  *函数名称:void vdr_11_put( void )
  *功能描述:写入疲劳驾驶记录到flash中
			   超时,疲劳驾驶记录
			   有可能超时了，还在驾驶，这时要动态生成
			   等到车停以后，休息了足够的时间，才是一次完整的超时驾驶记录
			   如何保存?
  *输	入:	none
  *输	出:	none
  *返 回 值:none
  *作	者:郭智勇
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void vdr_11_put( void )
{
	uint32_t	addr;
	uint8_t		buf[64];                            /*保存要写入的信息*/

	buf[0]	= mytime_now >> 24;
	buf[1]	= mytime_now >> 16;
	buf[2]	= mytime_now >> 8;
	buf[3]	= mytime_now & 0xFF;
	memcpy( buf + 4, jt808_param.id_0xF009, 18 );   /*驾驶证号码*/

	//mytime_to_bcd( buf + 22, vdr11_mytime_start );
	//mytime_to_bcd( buf + 28, mytime_now );
	mytime_to_bcd( buf + 22, utc_to_mytime(jt808_param_bk.utc_over_time_start));
	mytime_to_bcd( buf + 28, utc_to_mytime(jt808_param_bk.utc_over_time_end) );

	PACK_INT( buf + 34, ( jt808_param_bk.vdr11_longi_start * 6 / 10 ) );	///郭爷这里有错误(vdr11_longi_start*6)，应该是(vdr11_longi_start*6/10)
	PACK_INT( buf + 38, ( jt808_param_bk.vdr11_lati_start * 6 / 10 ) );
	PACK_WORD( buf + 42, jt808_param_bk.vdr11_alti_start );

	PACK_INT( buf + 44, ( jt808_param_bk.vdr11_longi_end * 6 / 10) );
	PACK_INT( buf + 48, ( jt808_param_bk.vdr11_lati_end * 6 / 10 ) );
	PACK_WORD( buf + 52, jt808_param_bk.vdr11_alti_end);

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	addr = vdr_08_12_get_nextaddr( 11 );
	if( ( addr & 0xFFF ) == 0 ) /*在4k边界处*/
	{
		sst25_erase_4k( addr );
	}
	sst25_write_through( addr, buf, 54 );

	rt_sem_release( &sem_dataflash );
	//rt_kprintf( "\n%d>save 11 data addr=%08x", rt_tick_get( ), addr );
}

