icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/vdr.c
/*
   读取超速驾驶记录
   输入起止时间，获取最多记录数
   pout返回得到的记录

   就返回最近9条记录吧
 */
/*********************************************************************************
  *函数名称:uint8_t vdr_16_get( MYTIME start, MYTIME end, uint8_t num, uint8_t *pout )
  *功能描述:读取超速驾驶记录，输入起止时间，获取指定的记录数，防止溢出
  *输	入:	start	:开始时间
  			end		:结束时间
  			num		:最大记录数量
  			pout	:保存获取到的超速信息
  *输	出:	pout	:保存获取到的超速信息
  *返 回 值:uint8_t	:获取到的超速记录数量
  *作	者:郭智勇
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
uint8_t vdr_16_get( MYTIME start, MYTIME end, uint8_t num, uint8_t *pout )
{
	uint32_t	addr;
	uint8_t		buf[32];
	uint32_t	id;
	uint16_t	i, count = 0;
	MYTIME		mytime1;
	MYTIME		mytime2;
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	if(vdr16_addr_curr >= VDR_16_END)
		vdr16_addr_curr = VDR_16_START;
	if(vdr16_addr_curr < VDR_16_START)
		vdr16_addr_curr = VDR_16_START;
	vdr16_addr_curr &= 0xFFFFFFE0;
	addr = vdr16_addr_curr;
	for( i = 0; i < 256; i++ )  /*不一次读进来了*/
	{
		sst25_read( addr, buf, 32 );
		if( addr == VDR_16_START )
		{
			addr = VDR_16_END;
		}
		addr -= 32;
		id = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
		if( id == 0xFFFFFFFF )  /*不是有效记录*/
		{
			continue;
		}
		mytime1 = mytime_from_bcd(buf + 4);
		mytime2 = mytime_from_bcd(buf + 10);
		if(((mytime1>=start)&&(mytime1<=end))||((mytime2>=start)&&(mytime2<=end)))
		{
			memcpy( pout + count * 14, buf + 4, 6 );
			memcpy( pout + count * 14 + 6, buf + 10, 6 );
			pout[count * 14 + 12]	= buf[16];
			pout[count * 14 + 13]	= buf[17];
			count++;
			if(count >= num)
				break;
		}
	}
	rt_sem_release( &sem_dataflash );
	return count;
}

/*********************************************************************************
  *函数名称:void vdr_16_put( MYTIME start, MYTIME end, uint16_t speed_min, uint16_t speed_max, uint16_t speed_avg )
  *功能描述:写入超速驾驶记录到flash中
  *输	入:	start	:开始时间
  			end		:结束时间
  			speed_min:最小速度
  			speed_max:最大速度
  			speed_avg:平均速度
  *输	出:	none
  *返 回 值:none
  *作	者:郭智勇
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void vdr_16_put( MYTIME start, MYTIME end, uint16_t speed_min, uint16_t speed_max, uint16_t speed_avg )
{
	uint32_t	addr;
	uint8_t		buf[32]; /*保存要写入的信息*/

	vdr16_id_curr++;
	buf[0]	= vdr16_id_curr >> 24;
	buf[1]	= vdr16_id_curr >> 16;
	buf[2]	= vdr16_id_curr >> 8;
	buf[3]	= vdr16_id_curr & 0xFF;
	mytime_to_bcd( buf + 4, start );
	mytime_to_bcd( buf + 10, end );
	PACK_WORD( buf + 16, speed_min );
	PACK_WORD( buf + 18, speed_max );
	PACK_WORD( buf + 20, speed_avg );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	vdr16_addr_curr += 32;
	if( vdr16_addr_curr >= VDR_16_END )
	{
		vdr16_addr_curr = VDR_16_START;
	}

	sst25_write_back( addr, buf, 22 );
	rt_sem_release( &sem_dataflash );
	//rt_kprintf( "\n%d>save16 data id=%d,addr=%08x", rt_tick_get( ), vdr16_id_curr, addr );
}


void over_time_init_run(void)
{
	if((jt808_param_bk.utc_car_run!=0)\
		&&(jt808_param_bk.utc_car_run < jt808_param_bk.utc_over_time_end)\
		&&(jt808_param_bk.utc_over_time_end < utc_now) \
		&&(jt808_param_bk.utc_over_time_end - jt808_param_bk.utc_car_run >= jt808_param.id_0x0057))
	{
		vdr_11_put( );
	}
	jt808_param_bk.utc_car_run 		= utc_now;
	jt808_param_bk.vdr11_lati_start	= gps_lati;
	jt808_param_bk.vdr11_longi_start	= gps_longi;
	jt808_param_bk.vdr11_alti_start	= gps_alti;
}

/*
   每秒判断车辆状态,gps中的RMC语句触发
   行驶里程
   默认都是使用GPS速度，如果gps未定位，也有秒语句输出
 */

/*gps有效情况下检查车辆行驶状态*/
void process_overtime( void )
{
	static uint32_t utc_run		= 0;
	static uint32_t utc_stop	= 0;

/*判断车辆行驶状态*/
	if( jt808_param_bk.car_stop_run == STOP )                                                              /*认为车辆停止,判断启动*/
	{
		if( jt808_param_bk.utc_car_stop == 0 )                                                             /*停车时刻尚未初始化，默认停驶*/
		{
			jt808_param_bk.utc_car_stop = utc_now;
		}
		if( gps_speed >= SPEED_LIMIT )                                                      /*速度大于门限值*/
		{
			if( utc_run == 0 )                                                          /*还没有记录行驶的时刻*/
			{
				utc_run = utc_now;                                                      /*记录开始时刻*/
			}
			if( ( utc_now - utc_run ) >= SPEED_LIMIT_DURATION )                         /*超过了持续时间*/
			{
				utc_stop = utc_now;
				jt808_param_bk.car_stop_run = RUN;                                                         /*认为车辆行驶*/
				rt_kprintf( "\n%d>车辆行驶", rt_tick_get( ) );
				jt808_param_bk.car_alarm &= ~BIT_ALARM_STOP_OVERTIME;
			}
		}else	///车辆停止，休息中。
		{
			jt808_param_bk.car_alarm &= ~(BIT_ALARM_PRE_OVERTIME);
			jt808_param_bk.car_alarm &= ~(BIT_ALARM_OVERTIME);
			if( utc_now - jt808_param_bk.utc_car_stop > jt808_param.id_0x005A )                            /*判断停车最长时间*/
			{
				over_time_init_run();
				jt808_param_bk.car_alarm |= BIT_ALARM_STOP_OVERTIME;
				//rt_kprintf( "\n%d>达到停车最长时间", rt_tick_get( ));
			}
			else if( utc_now - jt808_param_bk.utc_car_stop > jt808_param.id_0x0059)                             /*判断停车最短时间，达到该时间表示休息了一次*/
			{
				over_time_init_run();
				//rt_kprintf( "\n%d>达到停车最少时间", rt_tick_get( ));
			}
			
			utc_run = 0;
		}
	}else                                                                                   /*车辆已启动*/
	{
		if( jt808_param_bk.utc_car_run == 0 )                                                             /*停车时刻尚未初始化，默认停驶*/
		{
			over_time_init_run();
		}
		if( gps_speed <= SPEED_LIMIT )                                                      /*速度小于门限值*/
		{
			if( utc_stop == 0 )
			{
				utc_stop = utc_now;
			}
			if( ( utc_now - utc_stop ) >= SPEED_LIMIT_DURATION )                        /*超过了持续时间,等待判断停驶*/
			{
				utc_run = utc_now;
				//jt808_param_bk.utc_car_stop = utc_now;  
				jt808_param_bk.car_stop_run = STOP;                                                        /*认为车辆停驶*/
				rt_kprintf( "\n%d>车辆停驶", rt_tick_get( ) );
				vdr_10_put( mytime_now );                                                   /*生成VDR_10数据,事故疑点*/
			}
		}else ///车辆行驶中。
		{
			if( utc_now - jt808_param_bk.utc_car_run > jt808_param.id_0x0057 )                             /*判断连续驾驶最长时间*/
			{
				//rt_kprintf( "\n%d>疲劳驾驶", rt_tick_get( ) );
				jt808_param_bk.car_alarm &= ~(BIT_ALARM_PRE_OVERTIME);
				jt808_param_bk.car_alarm |= BIT_ALARM_OVERTIME;
				jt808_param_bk.utc_over_time_start	= jt808_param_bk.utc_car_run;
				jt808_param_bk.utc_over_time_end	= utc_now;
				jt808_param_bk.vdr11_lati_end		= gps_lati;
				jt808_param_bk.vdr11_longi_end		= gps_longi;
				jt808_param_bk.vdr11_alti_end		= gps_alti;
			}
			else if( utc_now - jt808_param_bk.utc_car_run > ( jt808_param.id_0x0057 - jt808_param.id_0x005C ) ) /*疲劳驾驶预警*/
			{
				//rt_kprintf( "\n%d>超时预警", rt_tick_get( ) );
				jt808_param_bk.car_alarm |= BIT_ALARM_PRE_OVERTIME;
			}
			
			jt808_param_bk.car_alarm &= ~(BIT_ALARM_STOP_OVERTIME);
			jt808_param_bk.utc_car_stop = utc_now;  
			utc_stop = 0;
		}
	}
}

/*超速、超速预警判断*/
void process_overspeed( void )
{
	static uint8_t	overspeed_flag = 0;
	static uint32_t utc_overspeed_start = 0;
	static MYTIME	mytime_overspeed_start;
	static uint32_t overspeed_sum	= 0;
	static uint32_t overspeed_count = 0;
	static uint16_t overspeed_min	= 0xFF;
	static uint16_t overspeed_max	= 0;

	uint16_t		gps_speed_10x	= gps_speed * 10;
	uint16_t		limit_speed_10x = jt808_param.id_0x0055 * 10;

	if( gps_speed >= jt808_param.id_0x0055 )                                /*超过最高速度*/
	{
		if( ( jt808_param.id_0x0050 & BIT_ALARM_OVERSPEED ) == 0 )  /*报警屏蔽字*/
			beep( 10, 1, 1 );
		if( utc_overspeed_start )                                           /*判断超速持续事件*/
		{
			if( utc_now - utc_overspeed_start >= jt808_param.id_0x0056 )    /*已经持续超速*/
			{
				if( ( jt808_param.id_0x0050 & BIT_ALARM_OVERSPEED ) == 0 )  /*报警屏蔽字*/
				{
					jt808_param_bk.car_alarm |= BIT_ALARM_OVERSPEED;
					//rt_kprintf( "\n%d>超速报警", rt_tick_get( ));
				}
				if(overspeed_count==0)
				{
					jt808_param_bk.utc_over_speed_start	= utc_overspeed_start;
				}
				jt808_param_bk.utc_over_speed_end 		= utc_now;
				overspeed_flag	= 2;                                        /*已经超速了*/
				overspeed_sum	+= gps_speed;
				overspeed_count++;
				if( gps_speed > overspeed_max )
				{
					overspeed_max = gps_speed;
					jt808_param_bk.over_speed_max= gps_speed;
				}
				if( gps_speed < overspeed_min )
				{
					overspeed_min = gps_speed;
				}
			}
		}else                                                               /*没有超速或超速预警，记录开始超速，*/
		{
			utc_overspeed_start		= utc_now;                              /*记录超速开始的时刻*/
			mytime_overspeed_start	= mytime_now;
		}
	}else
	{
		if( gps_speed_10x >= ( limit_speed_10x - jt808_param.id_0x005B ) )  /*超速预警*/
		{
			if( ( jt808_param.id_0x0050 & BIT_ALARM_PRE_OVERSPEED ) == 0 )  /*报警屏蔽字*/
			{
				jt808_param_bk.car_alarm |= ( BIT_ALARM_PRE_OVERSPEED );
				jt808_param_bk.car_alarm &= ~( BIT_ALARM_OVERSPEED );
				//beep( 10, 1, 1 );
			}
			overspeed_flag = 1;
		}else                                                               /*没有超速，也没有预警,清除标志位*/
		{
			if( overspeed_flag > 1 )                                        /*已经超速了,现在速度正常，要记录当前的超速记录*/
			{
				vdr_16_put( utc_to_mytime(jt808_param_bk.utc_over_speed_start), utc_to_mytime(jt808_param_bk.utc_over_speed_end), overspeed_min, overspeed_max, overspeed_sum / overspeed_count );
			}
			overspeed_flag	= 0;
			jt808_param_bk.car_alarm		&= ~( BIT_ALARM_OVERSPEED | BIT_ALARM_PRE_OVERSPEED );
		}
		utc_overspeed_start = 0;                                            /*准备记录超速的时刻*/
		overspeed_max		= 0;
		overspeed_min		= 0xFF;
		overspeed_count		= 0;
		overspeed_sum		= 0;
		if(overspeed_count)
		{
			jt808_param_bk.utc_over_speed_end= utc_now;
		}
	}
}

