icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/vdr.c
/*
   生成08-12发送的数据包
   不同的数据组包数是不同的。

   行车记录仪数据有校验

 */
void vdr_08_12_get_ready( uint8_t vdr_id, uint16_t seq, MYTIME start, MYTIME end, uint16_t totalrecord )
{
	uint32_t			addr;
	uint8_t				buf[16];
	JT808_TX_NODEDATA	*pnodedata;
	VDR_USERDATA		*puserdata;
	uint32_t			i;
	uint16_t			rec_count = 0;      /*找到的记录数*/

	uint8_t				sector;
	uint8_t				index;

	uint8_t				sector_from = 0xFF; /*置位没有找到*/
	uint8_t				index_from;

	uint8_t				sector_to;
	uint8_t				index_to;
	uint32_t			time_to = 0xFFFFFFFF;
	MYTIME				mytime;
	uint8_t				id;

	id = vdr_id - 8;

	/*从当前位置开始逆序查找*/
	rt_kprintf( "\n%d>开始遍历数据", rt_tick_get( ) );

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY_2 );

	sector	= sect_info[id].sector;                     /*从当前位置开始查找,倒序*/
	index	= sect_info[id].index;

	for( i = 0; i < sect_info[id].sector_count; i++ )   /*就是一个计数*/
	{
		addr = sect_info[id].addr_start + sector * 4096 + index * sect_info[id].record_size;
		sst25_read( addr, buf, 4 );
		mytime = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
		if( ( mytime >= start ) && ( mytime <= end ) )  /*在有效时间段内*/
		{
			rec_count++;
			if( rec_count >= totalrecord )              /*收到足够的记录数*/
			{
				break;
			}
			if( sector_from == 0xFF )                   /*第一个找到的就是最近的*/
			{
				sector_from = sector;
				index_from	= index;
			}
			if( mytime <= time_to )                     /*最小的才是最符合的*/
			{
				sector_to	= sector;
				index_to	= index;
				time_to		= mytime;
			}
		}

		if( index == 0 )
		{
			index = sect_info[id].record_per_sector; /*下面做了递减*/
			if( sector == 0 )
			{
				sector = sect_info[id].sector_count;
			}
			sector--;
		}
		index--;
	}
	rt_sem_release( &sem_dataflash );

	rt_kprintf( "\n%d>vdr%02d遍历结束(%d条) FROM %d:%d TO %d:%d",
	            rt_tick_get( ),
	            vdr_id,
	            rec_count,
	            sector_from, index_from,
	            sector_to, index_to );

	if( rec_count == 0 )    /*没有找到记录，也要上报*/
	{
		buf[0]	= seq >> 8;
		buf[1]	= seq & 0xff;
		buf[2]	= vdr_id;
		buf[3]	= 0x55;     /*vdr相关*/
		buf[4]	= 0x7a;
		buf[5]	= vdr_id;   /*命令*/
		buf[6]	= 0x0;      /*长度*/
		buf[7]	= 0x0;
		buf[8]	= 0x0;      /*保留*/
		buf[9]	= ( 0x55 ^ 0x7a ^ vdr_id );
		jt808_tx_ack( 0x0700, buf, 10 );
		return;
	}

	puserdata = rt_malloc( sizeof( VDR_USERDATA ) );

	if( puserdata == RT_NULL )
	{
		buf[0]	= seq >> 8;
		buf[1]	= seq & 0xff;
		buf[2]	= vdr_id;
		buf[3]	= 0x55; /*vdr相关*/
		buf[4]	= 0x7a;
		buf[5]	= 0xFA; /*采集出错命令*/
		buf[6]	= 0x0;  /*保留*/
		buf[7]	= ( 0x55 ^ 0x7a ^ 0xFA );
		jt808_tx_ack( 0x0700, buf, 8 );
		return;
	}
	puserdata->id				= vdr_id;
	puserdata->record_total		= rec_count;
	puserdata->record_remain	= rec_count;

	puserdata->sector_from	= sector_from;
	puserdata->index_from	= index_from;

	puserdata->sector_to	= sector_to;
	puserdata->index_to		= index_to;

	puserdata->sector	= sector_from;
	puserdata->index	= index_from;

	/*每包用户数据大小，加7 是因为第一包有vdr的头和校验*/
	i = sect_info[id].record_per_packet * sect_info[id].data_size + 7;

	/*计算要发送的数据总数，和单包最大字节数*/
	if( rec_count > sect_info[id].record_per_packet ) /*多包发送,*/
	{
		pnodedata = node_begin( 1, MULTI_CMD, 0x0700, 0xF000, i );
	} else
	{
		pnodedata = node_begin( 1, SINGLE_CMD, 0x0700, 0xF000, i );
	}
	if( pnodedata == RT_NULL )
	{
		rt_free( puserdata );
		puserdata	= RT_NULL;
		buf[0]		= seq >> 8;
		buf[1]		= seq & 0xff;
		buf[2]		= vdr_id;
		buf[3]		= 0x55; /*vdr相关*/
		buf[4]		= 0x7a;
		buf[5]		= 0xFA; /*采集出错命令*/
		buf[6]		= 0x0;  /*保留*/
		buf[7]		= ( 0x55 ^ 0x7a ^ 0xFA );
		jt808_tx_ack( 0x0700, buf, 8 );
		rt_kprintf( "\n无法分配" );
		return;
	}
	/*计算需要的数据包数*/
	pnodedata->packet_num	= ( rec_count + sect_info[id].record_per_packet - 1 ) / sect_info[id].record_per_packet;
	pnodedata->packet_no	= 0;
	rt_kprintf( "\n填充VDR数据" );

	vdr_08_12_fill_data( pnodedata );

	node_end( SINGLE_ACK,pnodedata, vdr_08_12_tx_timeout, vdr_08_12_tx_response, puserdata );
}

FINSH_FUNCTION_EXPORT_ALIAS( vdr_08_12_get_ready, vdr_get, get_vdr_data );


/*********************************************************************************
  *函数名称:void vdr_data_init(void)
  *功能描述:初始化行驶记录仪(VDR)数据存储相关参数
  			注意:该函数只能用来初始化存储区域，不可增加只能初始化一次的代码，不如不能初始化信号量
  			不能初始化线程等
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2014-03-5
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void vdr_data_init(void)
{
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );

	vdr_08_time = vdr_08_12_init( 8, 0 );
	memset( vdr_08_info, 0xFF, sizeof( vdr_08_info ) );
	vdr_09_time = vdr_08_12_init( 9, 0 );
	vdr_10_time = vdr_08_12_init( 10, 0 );
	vdr_08_12_init(11,1);
	vdr_16_init();
	rt_sem_release( &sem_dataflash );

}

/*
   初始化记录区数据
   因为是属于固定时间段存储的
   需要记录开始时刻的sector位置(相对的sector偏移)
 */
void vdr_init( void )
{
	uint8_t* pbuf;

	vdr_data_init();

/*初始化一个50ms的定时器，用作事故疑点判断*/
	rt_timer_init( &tmr_200ms, "tmr_200ms",     /* 定时器名字是 tmr_50ms */
	               cb_tmr_200ms,                /* 超时时回调的处理函数 */
	               RT_NULL,                     /* 超时函数的入口参数 */
	               RT_TICK_PER_SECOND / 5,      /* 定时长度，以OS Tick为单位 */
	               RT_TIMER_FLAG_PERIODIC );    /* 周期性定时器 */
	rt_timer_start( &tmr_200ms );
}

/*行车记录仪数据采集命令*/
void vdr_rx_8700( uint8_t * pmsg )
{
	uint8_t		* psrc;
	uint8_t		buf[100];
	uint8_t		tmpbuf[32];

	uint16_t	seq = JT808HEAD_SEQ( pmsg );
	uint16_t	len = JT808HEAD_LEN( pmsg );
	uint8_t		cmd = *( pmsg + 12 ); /*跳过前面12字节的头*/
	MYTIME		start, end;
	uint16_t	blocks;
	uint32_t	i;
	uint8_t		fcs;

	switch( cmd )
	{
		case 0x00: /*采集记录仪执行标准版本*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x00\x00\x02\x00\x12\x00", 8, &fcs );
			buf[11] = fcs;
			jt808_tx_ack( 0x0700, buf, 12 );
			break;
		case 0x01:
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x01\x00\x12\x00" "120221123456789\x00\x00\x00\x00", 25, &fcs );
			buf[28] = fcs;
			jt808_tx_ack( 0x0700, buf, 29 );
			break;
		case 0x02: /*行车记录仪时间*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x02\x00\x06\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, gps_baseinfo.datetime, 6, &fcs );
			buf[15] = fcs;
			jt808_tx_ack( 0x0700, buf, 16 );
			break;
		case 0x03:
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x03\x00\x14\x00", 6, &fcs );

			mytime_to_bcd( tmpbuf, mytime_now );            /*实时时间*/
			vdr_pack_buf( buf + 9, tmpbuf, 6, &fcs );

